var e=[`
一轮线索:

化妆室:

①经警方排查，掉在地上的定妆喷雾里的喷雾是"一碰即亡"毒药，也是致死原因。而旁边喝剩的半杯水里面混着安眠药。


②现场:吃完的盒饭，死者的水杯中剩半杯水，满地的化妆品，一封匿名的恐吓信\xA0(写着:甄演员，妳今日必死无疑)


③厕所的垃圾桶内有一双白色橡胶手套，手套上有“一碰既亡”的毒药残留痕迹，另外还有一个空矿泉水瓶，瓶内残留的水中也有安眠药，检测垃圾桶内的液体，发现正是被倾倒掉的定妆喷雾。


白经纪:
随身包里的助眠安眠药。


魏学霸:
微信和甜记者的聊天纪录(12:40\xA0魏学霸:姐姐，采访甄演员的时间是什么时候？甜记者回覆:时间是14:30。)


程导演:
口袋里甄演员的怀孕确诊单(经现场医生鉴定后，判定是伪造的)


严歌手:
手机里多张和甄演员的合照。


甜记者:
记者id证，采访录音笔，播放后是14:30甜记者和甄演员的采访内容。


`,`

白经纪:
手机微信里家人多次向白经纪要医疗费


魏学霸:
包里的安眠药药丸


程导演:
手机微信里4/17日曾打给甄演员一大笔钱。


严歌手:
严歌手化妆室里桌上一封匿名信件，里面有张照片是白经纪和甄演员拥吻的照片。


甜记者:
摄影机里内存卡有白经纪和甄演员拥吻的图片。



经走廊监视器显示：

12:50甜记者去过厕所。

14:00严歌手去过厕所。

14:40魏学霸去过厕所。

15:30程导演去过厕所。



活动流程:

12:30~13:15\xA0媒体进场\xA0

13:45~15:00\xA0媒体采访(后台)

15:30~16:10\xA0粉丝，观众进场

16:10~16:30\xA0主持人开场白，宣布活动开始

16:30~17:00\xA0导演，演员出场致词

17:00~19:00\xA0电影播映

19:00~19:30\xA0大合照，结束语

19:30~20:00\xA0粉丝媒体等离场


`];export{e as ClueTurn};