var e=[`白经纪`,`程导演`,`甜记者`,`侦探`,`魏学霸`,`严歌手`],t={白经纪:`你和甄演员从高中就在一起了，相恋已5年多了。没想到甄演员在大学时期的校外被一个星探发掘，甄演员从此走入演艺圈的道路。而你，为了陪伴甄演员，也当上了她的经纪人。

\xA0  甄演员火了之后，原公司极力反对你们的交往，所以你怂恿甄演员自己出来开工作室，甄演员考虑后答应了。你们把这些年积攒的积蓄拿出一半交了违约金，原公司也签署了保密合同，不会暴露你二人的恋情。

\xA0  2016年6月，工作室设立了，但初期一直在赔钱，甄演员受到这差别待遇后，对当初怂恿她的你日渐冷淡。不仅禁止你跟任何人提起你们在交往的事情，而且把你的积蓄全拿去给工作室用了。为此，你也只能更加努力工作，以补缺工作室资金上的不足。

\xA0  直到2017年7月，工作室才开始慢慢稳定。可是甄演员并给你金钱上的补偿，她总是跟你说，自己人还计较什么呢？你无奈之下也只好作罢。

\xA0  2017年9月15日，你接到知名导演---程导演的邮件，邮件大概写着:我这里有个剧本，目前女主角人选还没确定，甄演员有兴趣出演的话，请于9月20日晚上8点到王牌酒店233号房试镜。确定之后，后续再讨论价钱问题。

\xA0  你给甄演员看过之后，甄演员想了一会儿便答应了。

\xA0  你有点担心，因为导演一般不会选在酒店房间里试镜，你怕出事情所以劝甄演员不要去。

\xA0  甄演员却对你说，往年程导演的作品都得到非常好的票房，放过这次机会就没有下次了，便是龙潭虎穴，也要去闯闯。

\xA0  你劝不动甄演员，只能忍着答应了。

\xA0  9月20日甄演员去面试之后，回来就跟你说搞定了。你虽怀疑，但甄演员却闭口不谈。

\xA0  2017年10月30日，电影  < 为妳打call >  正式开机。

\xA0  2018年2月20日，电影正式杀青，电影进入后制和宣传阶段。

\xA0  奇怪的是，电影官宣之后，你一直收到匿名的信件，里面都是辱骂和诅咒的字眼，全是针对甄演员。\xA0(例如:"贱女人，离严歌手远一点，不然给你好看！"或
者"姓甄的，你不得好死！")你考虑到甄演员正在专心演戏的阶段，所以你把信件全藏起来了，准备事后再追究责任，也没告知甄演员。

\xA0  3月底，你的母亲突然住院，急需一大笔钱，而你的工资全在甄演员那儿。你多次向甄演员提起，她却总以电影宣传忙为理由回绝你。

\xA0  不只甄演员宣传忙，你身为经纪人，你更忙。在工作跟家人方面两头烧的状况下，你的精神状况开始出现异常，每天虽然累成狗却总是睡不着。不得已，你只好购买安眠药来帮助自己入眠以保持好精神好体力。

\xA0  4月19日，10:00。你开车载着甄演员到了666国际影城的电影首映礼会场后台。\xA0\xA0

\xA0  12:00，趁着甄演员梳妆打扮的时候，你出去拿了两个盒饭回来。拿盒饭时，你遇上严歌手，你跟他不熟，他却恶狠狠的瞪着你，你不想跟他多交谈便赶紧回去了。

\xA0  12:30，会场开始开放媒体进场了，你也去到了会场看看情况。

\xA0  14:30，到了媒体采访的时间，有位记者与其他记者不同，她代表芒果日报对甄演员提出了很多尖酸刻薄的问题，最后甚至提到是否有地下恋情的问题，你见情况不对，赶快拦了下来。

\xA0  16:10，主持开始说开场白。

\xA0  16:30，程导演，严歌手，甄演员等主创开始出来致词。你感觉甄演员好像有点精神恍惚，所以17:00电影开始后五分钟你就扶着甄演员进后台化妆室休息。

\xA0  甄演员跟你说她很困，可能是昨晚太紧张所以没有睡好，所以想趴在桌上睡会儿。你看了看时间后跟她说，那行等到电影快结束我再来叫你去会场跟粉丝大合照，这个一定要参加，否则别人会说她耍大牌。

\xA0  18:50，你到了化妆间要叫醒甄演员，却发现甄演员以不寻常的姿势趴在化妆桌，而且面露痛苦之色。你伸手探了鼻息，发现没气了！你吓的赶紧报警，并叫来所有相关人员。



\xA0\xA0\xA0\xA0任务：

\xA0\xA0\xA0\xA0① 你不是凶手，请洗脱嫌疑

\xA0\xA0\xA0\xA0② 尽力维护甄演员的公众形象
你需要主动说出的事情：

\xA0\xA0\xA0\xA0① 甄演员当时和程导演试镜的事

\xA0 \xA0

\xA0\xA0\xA0\xA0你不能主动暴露的事情：

\xA0\xA0\xA0\xA0① 你和甄演员的情侣关系
`,程导演:`你是一位赫赫有名的导演兼编剧，拍过不少大片，也已经获奖无数次了。

\xA0  娱乐圈每个人都在巴结你，就为了能沾点光，得点好处。

\xA0  尤其是当红女星，总想靠着跟你潜规则而上位。

\xA0  这些倒贴的女星你几乎来者不拒，反正你有的是钱和人脉关系。谁敢造次，明天就得在娱乐圈消失！

\xA0  某天，你在家无聊的看着电视，一台切过一台。

\xA0  突然，萤幕里有一个女生吸引了你，那便是甄演员。萤幕里的她清纯，甜美，可爱，让人想好好疼惜她。

\xA0  你拿起手机打给助理，让你的助理把甄演员的资料全发过来。

\xA0  看完甄演员的资料后，你决定了。你要为她打造一部电影！

\xA0  于是乎，你宣布闭关，开始提笔写剧本。

\xA0  这一写就是两年，前后删删改改了无数次，最后在2017年8月，你终于完成这个剧本了。而电影的名字就是 <   为妳打call！\xA0>
\xA0\xA0\xA0\xA0\xA0
\xA0  9月15日，你发了封邮件给甄演员的经纪人---白经纪，上面写着:我这里有个剧本，目前女主角人选还没确定，甄演员有兴趣出演的话，请于9月20日晚上8点到王牌酒店233号房面试。确定之后，后续再讨论价钱问题。（附上剧本大纲）

\xA0  你虽然早已决定女主角是甄演员，但她毕竟还算新人，所以你决定还是来个试镜。何况这也是一个正式跟甄演员见面的机会，你也不想放过。
\xA0\xA0\xA0\xA0\xA0
\xA0  9月20日20:00，王牌酒店233号房。

\xA0  甄演员如约而至，她穿着白色衬衫和米色长裙，显得更加动人。

\xA0  你故意说:其实女主角已经决定了，将会由不重要一线女星来出演。

\xA0  甄演员眉头马上皱了起来，她问你既然已经决定了为何又发邮件来询问出演意愿呢？

\xA0  你看着楚楚可怜的甄演员，心中动了歹念，你坏笑着说:就看你诚意如何了。

\xA0  甄演员立即明白你的意思，最后与你发生了关系。\xA0

\xA0  2017年10月30日，电影  <为妳打call！>  正式开机。你选了严歌手当男主角，他一口就答应了，这倒让你觉得很惊讶，因为他之前从未进过影视界，还拒绝过很多知名导演的邀请。

\xA0  2018年2月20日，电影正式杀青并进入后制与宣传阶段。
\xA0\xA0\xA0\xA0\xA0
\xA0  4月17日，你收到甄演员微信的信息，上面写着:我怀孕了。并传来一张图片，图片是甄演员的怀孕确诊单。

\xA0  你当下脑子就死机了，不过你也是见过大风大浪的人，马上恢复了镇定。

\xA0  你问甄演员:你究竟想要什么?

\xA0  甄演员回覆:钱，我要钱。还有之后你必须给我资源捧红我。你若是答应，我就去把孩子打掉。

\xA0  你无奈之下只好答应并转给甄演员一大笔钱，但同时你也对甄演员是否怀孕的真实性表示怀疑，你决定拿到那份确诊单并亲自去查验真假。
\xA0\xA0\xA0\xA0\xA0
\xA0  4月19日12:15，你来到666国际影城的电影首映礼会场后台。经过甄演员的化妆室时，你看见她和白经纪在吃盒饭。

\xA0  12:30，你到了会场开始处理杂七杂八的事情。

\xA0  14:20，你接受完采访后，你看到甄演员开始接受芒果日报的采访。

\xA0  14:27，你溜进甄演员的化妆室，搜了她的包包，找到了确证单，塞到了自己口袋，然后你又匆匆离开了。

\xA0  16:10，胡主持开始说开场白。

\xA0  16:30，你和严歌手，甄演员等主创开始致词。你发现甄演员的精神不佳，你作贼心虚的想着，不会是怀孕造成的不舒服吧?

\xA0  17:00，电影开始播映，你坐在观众席和观众一起观看。

\xA0  18:50，你被工作人员叫到后台，说是甄演员死了。



\xA0 \xA0 任务：


\xA0\xA0\xA0\xA0① 你不是凶手，请洗清嫌疑


\xA0\xA0\xA0\xA0你需要主动说出的事情：


\xA0 \xA0 ① 严歌手很痛快的答应了参演邀请

\xA0 \xA0


\xA0\xA0\xA0\xA0你不能主动暴露的事情：

\xA0\xA0\xA0\xA0① 你潜规则过死者，甚至可能导致其怀孕
`,甜记者:` 你从小父母就过世了，和唯一的妹妹---魏学霸相依为命。为了供妹妹读书，你放弃了学业，你到处打零工，后来终于在芒果日报找到了一份你非常喜欢的工作，那就是记者。

\xA0  你非常努力的工作，终于在前些年当上了八卦栏目的组长。
\xA0\xA0\xA0\xA0\xA0
\xA0  你当上组长没多久，你的妹妹有天突然跟你说，她不要念书了，她要为了严歌手而活！

\xA0  你一直是非常宠爱这个妹妹的，之前也大概知道妹妹在追星，但碍于自己工作忙碌，你都没能好好了解妹妹的状况，没想到已经到了这么夸张的地步。

\xA0  妹妹以前一直是个模范生，学习非常认真还申请了不少奖学金，你为此一直很骄傲。

\xA0  现在妹妹突然要放弃一切，你当然不愿意，苦口婆心的劝了她好几回都无果。
\xA0\xA0\xA0\xA0\xA0
\xA0  你时常想着，这都是严歌手的错，把你的妹妹变成这副德行！

\xA0  于是你运用自己的身分，常常去跟拍严歌手，就是想抓住严歌手的把柄然后公诸于世，让妹妹死了这条心。

\xA0  无奈严歌手并没有什么花边新闻，老是埋首于音乐创作，所以你更加拿妹妹的疯狂没办法了。
\xA0\xA0\xA0\xA0\xA0
\xA0  2017年，在11月某天的半夜，你和助理开着车来到严歌手的新电影 <为妳打call!>的拍戏现场大门门口，想拍严歌手的八卦，却始终苦等不到严歌手出来。正当你快要睡着时，你的助理喊醒了你，你定睛一看，全身包紧紧的甄演员居然从侧门出来了，旁边还有一个头戴棒球帽的黑衣男子，那个男子却不是严歌手。你在大脑进行了搜索，想起来那位男子正是甄演员的经纪人---白经纪！

\xA0  下一秒，他俩竟然相拥而吻！你本能的拿起相机连拍了好几张相片，这可是大八卦啊！

\xA0  据你所知，甄演员靠着清纯的外表和个性大火。最近拍了这部电影还和严歌手传了非常多绯闻，大家都在传他俩早已在一起了，粉丝也都站定真人cp了！而且你听同行说，曾经采访问过严歌手是否和甄演员在交往，严歌手甚至没有否认。没想到甄演员早就心有所属！对象还是自己的经纪人！\xA0\xA0\xA0

\xA0  回家之后你想着，既然无法抓到严歌手的把柄，那就把此事告诉他，如果他俩真有恋情，这可对他是个不小的打击。\xA0\xA0\xA0\xA0\xA0

\xA0  于是你故意选在电影首映礼的前两天，匿名把照片寄给了严歌手。而且还告诉了魏学霸这件事，希望她能就此清醒。
\xA0\xA0\xA0\xA0
\xA0  魏学霸非常生气，你看出来她又在动一些歪脑筋，你怕妹妹做出什么事情，于是劝说你会在首映礼当天采访环节逼问这件事，不要冲动行事。妹妹才点头答应。
\xA0\xA0\xA0\xA0\xA0
\xA0  4月19日，< 为妳打call！>电影首映礼开始。

\xA0  12:30，你以芒果日报记者的名义进入到会场。

\xA0  12:40，魏学霸发微信问你甄演员的采访时间，你回答"14:30"。你虽好奇妹妹问这个干嘛，却也忙于准备而没有多问。

\xA0  14:30，轮到芒果日报采访电影主创了。你今天特别步步进逼甄演员。最后，你看采访时间快结束了，你豁出去的问"请问甄老师是否还和以前一样单身呢？还是其实已经有了地下恋情？"你看到甄演员的脸色变了，一旁的白经纪赶紧打断你说采访时间结束了。你知道，这事的真实性是跑不掉了。
\xA0\xA0\xA0\xA0\xA0
\xA0  16:10，胡主持宣布活动开始，你坐到媒体区准备拍摄。

\xA0  16:30，电影主创出来致词，其中你感觉甄演员脸色不太对劲，却不以为意。

\xA0  17:00，电影开始播映。\xA05分钟过后，甄演员被白经纪扶进后台。

\xA0  18:50，电影快结束了，你听到后台有人惊呼，你抓着摄影机就往后台冲，你直觉有新闻可拍，没想到却看见甄演员趴在化妆室桌上没了呼吸。

\xA0  19:00，警察来了并封锁现场。


\xA0 \xA0 任务：

\xA0\xA0\xA0\xA0① 你不是凶手，请洗清嫌疑

\xA0\xA0\xA0\xA0你需要主动说出的事情：

\xA0 \xA0 ①\xA0魏学霸非常喜欢严歌手
\xA0 \xA0
\xA0\xA0\xA0\xA0你不能主动暴露的事情：

\xA0\xA0\xA0\xA0① 你偷拍了死者与白经纪的照片，并匿名给了严歌手`,侦探:`
  故事导览：

  \xA0\xA0\xA0\xA04月19日著名导演---程导演的电影作品《为妳打call》首映礼如期举行，众星和粉丝们齐聚666国际影城。

  \xA0\xA0\xA0\xA0随着男女主角，严歌手和甄演员的亮相，现场气氛提高至最高点。

  \xA0\xA0\xA0\xA0不料，18:50电影快要结束时，后台却传来甄演员死亡的消息。

  \xA0\xA0\xA0\xA0是有人蓄意妄为呢?还是另有原因?

  \xA0\xA0\xA0\xA0警察随之封锁现场，并锁定五名嫌疑人。

*除了嫌犯可以对你撒谎，其他人都不能对你撒谎，所以请尽可能针对案情对他们提问，这样你才能更快接近真相。

你的故事：
你是一位经验老道的侦探，经常处理一些棘手的案件，由你经手的案子没有不能破获的。
和死者有过密切接触的嫌疑人有六位，分别是：

       ①\xA0白经纪，男，26岁，甄演员的经纪人。

       ②\xA0魏学霸，女，19岁，甜记者的妹妹。

       ③\xA0程导演，男，42岁，《为妳打call！》电影导演。

       ④\xA0严歌手，男，25岁，《为妳打call！》电影男主角。

       ⑤\xA0甜记者，女，27岁，芒果日报记者。

相信你这次也一定能顺利破案！

你的目标：
1.找出凶手，搞清楚死者死亡的前因后果：包括凶手动机，杀人手法，死者当日发生了什么。

2.找出每个人的秘密。

你的特权：（可以不用告诉别人）

1. 首映礼流程:

活动时间:2018.4.19，16:10
活动地点:666国际影城《一号厅》
活动主题:电影 < 為妳打call！> 首映礼
活动主持人:胡主持
活动嘉宾:程导演，甄演员，严歌手，不重要的男配角，不重要的女配角


2.私聊时间，你可以强制嫌疑人立即和你进行私聊，对方不可拒绝。
`,魏学霸:`你19岁，原是一名学生，父母去世的早，你和姐姐甜记者相依为命。

\xA0  原本你是个奋发向上的好学生，还得了不少奖学金。直到有次学校活动，邀请了严歌手来演唱，你对他一见钟情。聪明的你很明白，这不是粉丝对偶像的崇拜，而是深入骨髓的爱。

\xA0  从此，妳加入了严歌手后援会。一路从什么都不会的小透明变成一手包办所有活动的后援会会长。

\xA0  你甚至荒废了学业，成了辍学生，靠着以前的奖学金和后援会贩卖的周边得到的钱维持追星生活。

\xA0  你的姐姐甜记者虽然经常劝你别盲目追星，但你始终不听。

\xA0  2017年11月1日，妳刷微博突然看见严歌手之前决定出演男主角的电影<为妳打call!>的官宣，女主角居然是甄演员！

\xA0  你大为震惊，因为之前你透过姐姐得知，严歌手好像很喜欢甄演员这种清纯类型的女生，而且还常常在媒体采访的时候提起希望有机会能与甄演员合作。

\xA0  这是严歌手的第一个影视作品，当初姐姐跟你说的严歌手要演戏的时候你还特别高兴，你以为严歌手要朝着全方位艺人的方向前进，所以决定接影视作品了！

\xA0  没想到居然是为了跟甄演员合作！

\xA0  愤怒的你开了微博小号，疯狂的到甄演员的微博底下评论黑她。你甚至写了好多封匿名骂人信件，寄到甄演员的工作室。你希望通过这些手段败坏甄演员的名声，让她知难而退。

\xA0  2018年4月17日，你的姐姐告诉你，她手中握有甄演员的大料。你一问之下才知道，甄演员其实早就有男朋友了，那个人就是她现在的经纪人，白经纪。
\xA0\xA0\xA0
\xA0  你没想到甄演员藏的那么深，表面上的人设都是假的，而且还妄想勾搭上你的严歌手。不行，你必须让甄演员付出代价！

\xA0  你的姐姐不愧是记者，看出了你的小心思，于是劝你说，她会在19日的媒体采访环节逼问这件事，让你不要闯祸，乖乖看首映就好了。

\xA0  你表面上同意了，心里却另有计画。

\xA0  4月19日，<为妳打call!>电影首映礼开始了。

\xA0  12:30，你看见你姐姐以记者的名义入场后没多久，你发了信息给姐姐，你让姐姐告诉你采访甄演员的时间。姐姐回覆你，采访时间是14:30。

\xA0  14:25，妳带着在14:00下了安眠药的矿泉水和匿名恐吓信悄悄溜到了甄演员的化妆室。

\xA0  你正准备放矿泉水跟恐吓信的时候，你听见门开了的声音，你吓了一跳，赶紧躲到甄演员的衣柜里。

\xA0  你听到有个人走进来。

\xA0  14:30，那个人离开了，你正想出来，又听见开门声，你停止出来的动作。

\xA0  2分钟后，你听见脚步往外的声音还有关门的声音后，你才出来。你把矿泉水倒在甄演员化妆台上的杯子里，把恐吓信放在桌上。然后就把矿泉水瓶丢到厕所里，去会场主入口了。

\xA0  安眠药的药效是沉睡3个小时（因个人体质会有5~20分钟的误差)

\xA0  你的计画是，电影播放环节，甄演员不会出现，而会在化妆室睡觉。

\xA0  电影结束后的大合照，甄演员势必赶不上，到时候她就会遭到责骂，而自己也可以借机爆出甄演员和白经纪的恋情，到时候甄演员就会身败名裂了。

\xA0  15:30，你跟着其他粉丝观众一起进入会场。

\xA0  16:10，胡主持宣布活动开始。

\xA0  16:30，甄演员和其他电影主创一起出来致词，你看出甄演员开始出现精神不济的情况。

\xA0  17:05，电影刚开始，甄演员就被白经纪扶进后台休息了。

\xA0  18:50，电影播到片尾了，你正暗笑着呢，突然看见后台一阵骚动。

\xA0  19:00，警察来了，封锁了现场。你打电话问姐姐怎么回事，她却跟你说甄演员死了。




任务：

① 你不是凶手，请洗脱嫌疑

② 不让你的偶像被怀疑成凶手


你需要主动说出的事情：

① 在14：25到14：30间除你之外有两个人进过案发现场化妆室（当你的行踪暴露之后才可说）


\xA0 \xA0

你不能主动暴露的事情：

① 你给甄演员寄过很多恐吓信

② 你姐姐甜记者掌握了死者很多猛料

③ 安眠药是你下给甄演员的
`,严歌手:`20岁那年，你参加<快活男声>，一路过关斩将获得优胜。21岁正式签约，成为家喻户晓的大明星。你一直专注在唱歌，发片，做音乐。很多导演相中你的外貌，想请你转型做演员，但全部都被你回绝了。

\xA0  直到2015年，你在一次明星朋友们聚餐中遇到了刚出道的甄演员，你马上坠入爱河，但是碍于面子问题，你没有直接跟她要联络方式。而且甄演员旁边的经纪人好像一直在盯着你的一举一动，似乎想看穿你的心思。

\xA0  于是你在日后多次的媒体采访中提到，希望有机会能和甄演员合作。

\xA0  但是2016年，甄演员的消息突然像石沉大海般，一点代言和影视作品也没有。你跟媒体朋友打听后才知道，甄演员自己出来开工作室了，而且听说资金非常缺乏。自己因为上头有公司管着，所以也无能为力。

\xA0  好在2017年，甄演员的工作室慢慢步入正轨，你也算松了一口气。

\xA0  2017年9月1日，你收到知名导演---程导演的剧本试镜邀请。你原本想着回绝，但是你后来从助理那儿得知，女主角是甄演员。你喜出望外，等了那么久的机会终于来了。

\xA0  你通报公司后，公司也同意你出演了。

\xA0  2017年10月30日，电影<为妳打call!>正式开机。

\xA0  2018年2月20日，电影杀青，进入后制与宣传阶段。

\xA0  电影拍摄期间，你跟甄演员似乎也越来越近，中间还常常一起出去吃饭。在三月底的时候你跟甄演员告白，甄演员也同意跟你交往了。在娱乐圈，恋情必然是隐秘的，你俩也只敢偷偷约会。
\xA0\xA0\xA0\xA0\xA0
\xA0  4月17日，你收到一封匿名信件，打开后只有一张照片，照片上是全身包的严严实实的甄演员和一个戴着棒球帽的黑衣男子当街拥吻。

\xA0  虽然帽沿盖住了男子的眼睛，但是你认得出来，那个人便是时常盯着自己的白经纪！

\xA0  你深深的感受到背叛，中间和甄演员的约会都是假的，她清纯的外貌也是假的，她分明就是个脚踏两条船的绿茶婊！

\xA0  愤怒摧毁你的理智，于是你在心中下了一个决定，你要撕破她欺骗众人的面貌，把真正的甄演员公诸于世！

\xA0  4月19日，<为妳打call!>电影首映礼开始。

\xA0  10:30，你到了首映礼会场后台梳妆打扮。

\xA0  12:00，你出去拿了盒饭，途中遇到白经纪手揣两个盒饭，你知道那是给甄演员的，你狠狠的瞪了白经纪一眼。

\xA0  13:30，你离开666国际影城，去了附近的屈x氏买了一瓶平时甄演员使用的定妆喷雾。

   你戴上白色橡胶手套，把里面喷雾都倒掉，并把早早准备好的"一碰即亡"毒药倒了进去。你脱下手套，丢到了厕所的垃圾桶里。

\xA0  14:30，你看到白经纪陪同甄演员去后台接受各家媒体的采访，于是你趁着这个绝好的时机，进去甄演员的化妆室，把喷雾放在了化妆桌上显眼的地方后匆匆离开了。

\xA0  14:45，你也接受了各家媒体的采访，其中芒果日报的代表记者看你的眼神很奇怪。

\xA0  16:10，胡主持宣布活动开始。

\xA0  16:30，你和其他电影主创一同出来致词，你发现甄演员好像一脸疲惫。

\xA0  17:00，电影开始播映。\xA05分钟过后，你看见白经纪扶着甄演员去了后台。你怨恨的看着他们，想用眼神在他们身上烧出一个洞来。

\xA0  18:50，你听到后台一阵喧闹，跟着程导演一起跑去了后台。你看到甄演员趴在化妆桌上，你故意惊慌失措的问发生什么事了，白经纪跟你说甄演员死了。


任务：

① 你是凶手，请逃脱追捕

你需要主动说出的事情：

① 甄演员脱离原公司，自己出来做工作室，前期非常困难
\xA0 \xA0
你不能主动暴露的事情：

① 你和甄演员的情侣关系`};export{t as roleContent,e as roles};